{
  "backend/main.mo": "Defines core backend data types for tasks, meetings, reminders, messaging, clients, invoices, notifications, and workflow automation.",
  "feature_evidence.json": "Lists feature evidence entries describing implemented features, affected files, related components, and associated test IDs.",
  "frontend-file-summaries.txt": "Provides short textual summaries for major frontend files including components, pages, hooks, and styling configuration.",
  "frontend/index.html": "HTML entry point setting metadata, PWA manifest, icons, and mounting the React app.",
  "frontend/public/favicon.svg": "SVG favicon containing a gradient background and a stylized 'W'.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, theme colors, icons, and startup behavior.",
  "frontend/public/offline.html": "Offline fallback page with a gradient background, status message, and reload button.",
  "frontend/public/service-worker.js": "Service worker implementing network‑first navigation handling, cache‑first assets, offline fallback, and update lifecycle control.",
  "frontend/src/App.tsx": "Sets up authentication-aware root layout and configures routes for navigation hub and multiple dashboard sections.",
  "frontend/src/components/AdminDatabaseDashboard.tsx": "Provides an admin-only database viewer with tabs, search, record inspection, and formatted status displays.",
  "frontend/src/components/AIAssistantPanel.tsx": "Displays AI-generated productivity insights by analyzing tasks, meetings, and reminders with suggestion logic.",
  "frontend/src/components/AppointmentManagement.tsx": "Manages user appointments including create, edit, status updates, and delete actions with dialogs and forms.",
  "frontend/src/components/ClientIntakeForm.tsx": "Empty file with no implementation.",
  "frontend/src/components/ClientManagement.tsx": "Handles CRUD operations for clients with dialogs, form validation, and associations to tasks and appointments.",
  "frontend/src/components/Footer.tsx": "Renders a styled footer with branding and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "A header component that displays branding, theme toggle, notifications, and user profile with logout handling.",
  "frontend/src/components/InvoiceManagement.tsx": "Manages invoice creation, filtering, payment actions, and printing, using query hooks and dialogs.",
  "frontend/src/components/InvoicePrintView.tsx": "Renders a printable invoice layout showing client details, status, descriptions, and totals.",
  "frontend/src/components/KanbanBoard.tsx": "Displays and synchronizes a Kanban board with user tasks, supporting drag‑and‑drop, updates, and persistence.",
  "frontend/src/components/MailNotificationDemo.tsx": "Creates sample or custom mail notifications for testing via user input or quick actions.",
  "frontend/src/components/MessagingPanel.tsx": "Implements a full chat UI for viewing groups, creating groups, selecting a group, loading messages, and sending messages via backend hooks.",
  "frontend/src/components/NotificationCenter.tsx": "Provides a popover-based notification center for system and mail notifications with sorting, marking read, dismissing, and click handling.",
  "frontend/src/components/ProfileSetup.tsx": "Renders a simple profile creation form that saves a user’s name and department through a backend mutation.",
  "frontend/src/components/RemindersPanel.tsx": "Displays, creates, edits, and deletes reminders, including invoice-related reminders, with time scheduling and sorting.",
  "frontend/src/components/ScheduleView.tsx": "Manages a calendar interface for creating, editing, and deleting meetings with participants and time ranges.",
  "frontend/src/components/ServiceWorkerUpdatePrompt.tsx": "Shows an update prompt when a new service worker is available and triggers a refresh when accepted.",
  "frontend/src/components/StartupErrorBoundary.tsx": "Wraps startup components in an error boundary that renders a fallback UI when initialization errors occur.",
  "frontend/src/components/StartupErrorFallback.tsx": "UI fallback component showing startup errors with reload and reset actions.",
  "frontend/src/components/TaskList.tsx": "Task management UI providing creation, editing, filtering, and list/kanban views using query hooks.",
  "frontend/src/components/TimeManagement.tsx": "Dashboard component summarizing tasks, meetings, reminders, and completion statistics by day, week, and month.",
  "frontend/src/components/WorkflowAutomation.tsx": "Interface for viewing, creating, updating, and deleting workflow automation rules and logs.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and refreshes a backend actor based on Internet Identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login flow, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user, admin, and workflow data via the backend actor. Includes admin-specific queries and user profile utilities.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, theme variables, dark mode colors, and custom utility classes like glassmorphism and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering.",
  "frontend/src/pages/ClientPortal.tsx": "Empty page placeholder for the client portal.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tab-based navigation for tasks, schedule, reminders, messaging, clients, automation, and admin panels.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login screen using Internet Identity with feature highlights and animated visuals.",
  "frontend/src/pages/NavigationHub.tsx": "Shows a hub of navigation cards for major app sections, conditionally revealing admin-only options.",
  "frontend/src/utils/pwaReset.ts": "Provides utilities to clear caches and service workers for resetting the PWA and reloading the app.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, shadows, radii, plugins, and summer-themed color utilities.",
  "project_state.json": "Defines project metadata, known issues, and existing feature requirements for the WorkflowHub project."
}